//**************************************************
//
// Hackathon ( gauge.h )
// Author  : katsuki mizuki
//
//**************************************************
#ifndef _GAUGE_H_	// このマクロ定義がされてなかったら
#define _GAUGE_H_	// ２重インクルード防止のマクロ定義

//==================================================
// インクルード
//==================================================
#include "main.h"

//==================================================
// 列挙型
//==================================================
typedef enum
{
	GAUGE_TOP = 0,	// 上
	GAUGE_BOTTOM,	// 下
	GAUGE_LEFT,		// 左
	GAUGE_RIGHT,	// 右
	GAUGE_MAX
}GAUGE;

//==================================================
//プロトタイプ宣言
//==================================================
//--------------------------------------------------
// 初期化
//--------------------------------------------------
void InitGauge(void);

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitGauge(void);

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdateGauge(void);

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawGauge(void);

//--------------------------------------------------
// 設定
// 引数1  : D3DXVECTOR3 &pos / 始まりの位置
// 引数2  : D3DXCOLOR &col / 色
// 引数3  : float fWidth / 幅
// 引数4  : float fHeight / 高さ
// 引数5  : GAUGE gauge / 列挙型 中心の位置
// 返値   ; int / 配列のインデックス
//--------------------------------------------------
int SetGauge(const D3DXVECTOR3 &posStart, const D3DXCOLOR &col, float fWidth, float fHeight, GAUGE gauge);

//--------------------------------------------------
// 変更
// 引数1  : int nIdx / 配列のインデックス
// 引数2  : float fWidth / 幅
// 引数3  : float fHeight / 高さ
//--------------------------------------------------
void ChangeGauge(int nIdx, float fWidth, float fHeight);

//--------------------------------------------------
// サイズの設定
// 引数1  : int nIdx / 配列のインデックス
// 引数2  : float fWidth / 幅
// 引数3  : float fHeight / 高さ
//--------------------------------------------------
void SetSizeGauge(int nIdx, float fWidth, float fHeight);

//--------------------------------------------------
// 色の設定
// 引数1  : int nIdx / 配列のインデックス
// 引数2  : D3DXCOLOR &color / 色
//--------------------------------------------------
void SetColorGauge(int nIdx, const D3DXCOLOR &color);

#endif // !_GAUGE_H_
